[
  {
    "id": 1,
    "title": "Frontend Developer",
    "categoryId": 1,
    "category": "Frontend",
    "company": "TechCorp",
    "description": "Awesome opportunity for a Vue.js frontend Jedi with a background in Laravel and a passion for software engineering. Come join an industry-leading company and enjoy the flexibility of remote work while being surrounded by a friendly, capable team.",
    "location": "Remote",
    "createdAt": "02-25-2025"
  },
  {
    "id": 2,
    "title": "Backend Developer",
    "categoryId": 2,
    "category": "Backend",
    "company": "DevFirm",
    "description": "What We’re Looking For: In this role, an established professional with enough prior work experience in software development to achieve full productivity within 1.5 months from onboarding. This engineer should also be passionate, creative, motivated, and knowledgeable with amazing communication skills to help drive conversations with Meltwater Product and Engineering teams while really listening to their needs",
    "location": "New York",
    "createdAt": "02-20-2025"
  },
  {
    "id": 3,
    "title": "UI/Graphic Designer",
    "categoryId": 7,
    "category": "UX/UI",
    "company": "DevFirm",
    "description": "As Senior UX Consultant (with visual skills), you work inside the Professional Services Department, where you create the designs & wires for complex web applications (like Online Banking). You work closely with our customers to design end-to-end user experiences from the ground up. You define user journeys and intuitive designs. Within Backbase we have our own UX process that includes utilizing our UX pattern library and style guides to create wireframes, visual designs and other UX documentations.",
    "location": "On site",
    "createdAt": "02-20-2025"
  },
  {
    "id": 4,
    "title": "Senior DevOps Engineer",
    "description": "Avahi is seeking a Senior AWS DevOps Engineer to join our passionate and skilled team. This role presents a unique opportunity for a seasoned professional to drive the architecture, implementation, and management of AWS infrastructure, migration, modernization, and DevOps practices. The ideal candidate will play a pivotal role in shaping our technical landscape, optimizing project delivery processes, and contributing to our overall success. ",
    "categoryId": 4,
    "category": "DevOps",
    "company": "Avahi",
    "location": "Remote",
    "createdAt": "02-19-2025"
  }
]
